import pandas as pd

ROW_INDEX = {
    '左主干近段(pLM)': 0,
    '左主干中段(mLM)': 1,
    '左主干远段(dLM)': 2,
    '左前降支近段(pLAD)': 3,
    '左前降支中段(mLAD)': 4,
    '左前降支远段(dLAD)': 5,
    '左回旋支近段(pLCX)': 6,
    '左回旋支中段(mLCX)': 7,
    '左回旋支远段(dLCX)': 8,
    '右冠近段(pRCA)': 9,
    '右冠中段(mRCA)': 10,
    '右冠远段(dRCA)': 11,
    '第一对角支(D1)': 12,
    '第二对角支(D2)': 13,
    '中间支(RI)': 14,
    '第一钝缘支(OM1)': 15,
    '第二钝缘支(OM2)': 16,
    '左室侧后降支(L-PDA)': 17,
    '右室侧后降支(R-PDA)': 18,
    '左室侧后支(L-PLB)': 19,
    '右室侧后支(R-PLB)': 20
}


def create_formatted_df():
    # Define the column names
    columns = ["冠脉节段", "斑块种类", "类型", "症状", "大小(mm)", "狭窄程度", "闭塞"]

    # Example usage:
    rows = [
        ["左主干近段(pLM)", "-", "-", "-", "-", "-", "否"],
        ["左主干中段(mLM)", "-", "-", "-", "-", "-", "否"],
        ["左主干远段(dLM)", "-", "-", "-", "-", "-", "否"],
        ["左前降支近段(pLAD)", "-", "-", "-", "-", "-", "否"],
        ["左前降支中段(mLAD)", "-", "-", "-", "-", "-", "否"],
        ["左前降支远段(dLAD)", "-", "-", "-", "-", "-", "否"],
        ["左回旋支近段(pLCX)", "-", "-", "-", "-", "-", "否"],
        ["左回旋支中段(mLCX)", "-", "-", "-", "-", "-", "否"],
        ["左回旋支远段(dLCX)", "-", "-", "-", "-", "-", "否"],
        ["右冠近段(pRCA)", "-", "-", "-", "-", "-", "否"],
        ["右冠中段(mRCA)", "-", "-", "-", "-", "-", "否"],
        ["右冠远段(dRCA)", "-", "-", "-", "-", "-", "否"],
        ["第一对角支(D1)", "-", "-", "-", "-", "-", "否"],
        ["第二对角支(D2)", "-", "-", "-", "-", "-", "否"],
        ["中间支(RI)", "-", "-", "-", "-", "-", "否"],
        ["第一钝缘支(OM1)", "-", "-", "-", "-", "-", "否"],
        ["第二钝缘支(OM2)", "-", "-", "-", "-", "-", "否"],
        ["左室侧后降支(L-PDA)", "-", "-", "-", "-", "-", "否"],
        ["右室侧后降支(R-PDA)", "-", "-", "-", "-", "-", "否"],
        ["左室侧后支(L-PLB)", "-", "-", "-", "-", "-", "否"],
        ["右室侧后支(R-PLB)", "-", "-", "-", "-", "-", "否"]
    ]

    # Create the DataFrame using the provided row data
    data = []
    for row in rows:
        # Take the first element as '冠脉节段' and default '-' for other columns
        entry = [row[0]] + row[1:7]
        data.append(entry)

    # Construct DataFrame
    df = pd.DataFrame(data, columns=columns)
    return df
